src/main/resources/xjb/request.xml

<!--<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"-->
<!--                  xmlns:tns="http://spring.io/guides/gs-producing-web-service"-->
<!--                  xmlns:gs="http://spring.io/guides/gs-producing-web-service">-->
<!--    <soapenv:Header/>-->
<!--    <soapenv:Body>-->
<!--        <gs:addEmployeeRequest>-->
<!--            <tns:employeeDto>-->
<!--                <tns:id>1</tns:id>-->
<!--                <tns:name>Jons</tns:name>-->
<!--                <tns:surname>Jonson</tns:surname>-->
<!--                <tns:position>Engineer</tns:position>-->
<!--                <tns:salary>120000</tns:salary>-->
<!--                <tns:grade>first</tns:grade>-->
<!--                <tns:age>21</tns:age>-->
<!--                <tns:description>experience</tns:description>-->
<!--            </tns:employeeDto>-->
<!--        </gs:addEmployeeRequest>-->
<!--    </soapenv:Body>-->
<!--</soapenv:Envelope>-->

<!--<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"-->
<!--                  xmlns:tns="http://spring.io/guides/gs-producing-web-service"-->
<!--                  xmlns:gs="http://spring.io/guides/gs-producing-web-service">-->
<!--<soapenv:Header/>-->
<!--<soapenv:Body>-->
<!--    <gs:patchEmployeeRequest>-->
<!--        <tns:employeeDto>-->
<!--            <tns:id>20</tns:id>-->
<!--            <tns:name>JonsonBergverbvrebaby</tns:name>-->
<!--            <tns:surname>Jonson</tns:surname>-->
<!--            <tns:position>Engineer</tns:position>-->
<!--            <tns:salary>120000</tns:salary>-->
<!--            <tns:grade>first</tns:grade>-->
<!--            <tns:age>21</tns:age>-->
<!--            <tns:description>experience</tns:description>-->
<!--        </tns:employeeDto>-->
<!--    </gs:patchEmployeeRequest>-->
<!--</soapenv:Body>-->
<!--</soapenv:Envelope>-->


<!--<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"-->
<!--                  xmlns:tns="http://spring.io/guides/gs-producing-web-service"-->
<!--                  xmlns:gs="http://spring.io/guides/gs-producing-web-service">-->
<!--<soapenv:Header/>-->
<!--<soapenv:Body>-->
<!--    <gs:deleteEmployeeRequest>-->
<!--        <tns:id>20</tns:id>-->
<!--    </gs:deleteEmployeeRequest>-->
<!--</soapenv:Body>-->
<!--</soapenv:Envelope>-->

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                  xmlns:tns="http://spring.io/guides/gs-producing-web-service"
                  xmlns:gs="http://spring.io/guides/gs-producing-web-service">
    <soapenv:Header/>
    <soapenv:Body>
        <gs:getEmployeeRequest>
            <tns:id>40</tns:id>
        </gs:getEmployeeRequest>
    </soapenv:Body>
</soapenv:Envelope>